app/views/stores/index.html.erb

SELECT "stores".* FROM "stores"
---
      <div class="thumbnail well">
        <% if store.store_images.all.length == 0 %>