app/views/welcome/index.html.erb

SELECT  "markets".* FROM "markets" ORDER BY "markets"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  <div class="row">
        <%= render 'shared/markets', locals: { markets: @markets = Market.all[0..2] } %>