app/controllers/markets_controller.rb

  def index
    @markets = Market.all
---
SELECT "markets".* FROM "markets"

  def show
    @market = Market.find(params[:id])
    @stores = @market.stores.all.paginate(page:1,per_page:6)
    @reviews = @market.market_reviews.all.paginate(page:1,per_page:5)
---
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."market_id" = ?  [["market_id", 5]]
SELECT COUNT(*) FROM "stores" WHERE "stores"."market_id" = ?  [["market_id", 9]]
SELECT  "market_reviews".* FROM "market_reviews" WHERE "market_reviews"."market_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["market_id", 23], ["LIMIT", 5], ["OFFSET", 0]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."market_id" = ?  [["market_id", 9]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."market_id" = ?  [["market_id", 9]]

  def ajax_reviews
    @market = Market.find(params[:id])
    @reviews = @market.market_reviews.all.paginate(page:params['current_review_page'].to_i + 1,per_page:5)
---
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."market_id" = ? LIMIT ? OFFSET ?  [["market_id", 9], ["LIMIT", 5], ["OFFSET", 0]]

  def ajax_stores
    @market = Market.find(params[:id])
    @stores = @market.stores.all.paginate(page:params['current_store_page'].to_i + 1,per_page:6)
---
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "stores".* FROM "stores" WHERE "stores"."market_id" = ? LIMIT ? OFFSET ?  [["market_id", 11], ["LIMIT", 6], ["OFFSET", 12]]

  def create
    @market = Market.new(name: params['market']['name'],
    city: params['market']['city'],
    state: params['market']['state'],
    zipcode: params['market']['zipcode'],
    address: params['market']['address'],
    rating: 0,
    description: params['market']['description'],
    open_time: timestampe_helper(params['open_day'], params['market']['open_time']),
    close_time: timestampe_helper(params['open_day'], params['market']['close_time']))
    respond_to do |format|
      if @market.save
---
INSERT INTO "markets" ("name", "city", "state", "zipcode", "rating", "description", "open_time", "close_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @market.name = params['market']['name']
    @market.city = params['market']['city']
    @market.state = params['market']['state']
    @market.zipcode = params['market']['zipcode']
    @market.address = params['market']['address']
    @market.description = params['market']['description']
    @market.open_time = timestampe_helper(params['open_day'], params['market']['open_time'])
    @market.close_time = timestampe_helper(params['open_day'], params['market']['close_time'])
    respond_to do |format|
      if @market.save()
---
UPDATE "markets" SET "city" = ?, "state" = ?, "open_time" = ?, "updated_at" = ? WHERE "markets"."id" = ?  [["city", "Adak"], ["state", "AK"], ["open_time", 2], ["updated_at", 2017-04-02 01:53:20 UTC], ["id", 15]]

  def destroy
    @market.destroy
---
DELETE FROM "markets" WHERE "markets"."id" = ?  [["id", 980190962]]

    def set_market
      @market = Market.find(params[:id])
---
SELECT  "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]