app/controllers/products_controller.rb

  def index
    if params[:q]
      @search = Product.ransack(params[:q])
      @products = @search.result
    else
      @products = Product.all
---
SELECT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("store_id", "name", "quantity", "price", "description", "tag", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)