app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("user_id", "store_id", "rating", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["store_id", 1], ["rating", 1], ["description", "MyString"], ["created_at", 2017-03-08 14:39:47 UTC], ["updated_at", 2017-03-08 14:39:47 UTC]]
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save