app/controllers/stores_controller.rb

  def show
    @store = Store.find(params[:id])
    @products = @store.products.all.paginate(page:1,per_page:6)
    @reviews = @store.store_reviews.all.order("created_at DESC").paginate(page:1,per_page:5)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."store_id" = ? LIMIT ? OFFSET ?  [["store_id", 96], ["LIMIT", 6], ["OFFSET", 0]]
SELECT  "store_reviews".* FROM "store_reviews" WHERE "store_reviews"."store_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["store_id", 146], ["LIMIT", 5], ["OFFSET", 0]]

  def ajax_products
    @store = Store.find(params[:id])
    @products = @store.products.all.paginate(page:params['current_product_page'].to_i + 1,per_page:6)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 118], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."store_id" = ? LIMIT ? OFFSET ?  [["store_id", 118], ["LIMIT", 6], ["OFFSET", 12]]

  def destroy
    @store.destroy
---
DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 137]]