app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def show
    @user = User.find(params[:user_id])
    @vendor = Vendor.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT ?  [["id", 203045151], ["LIMIT", 1]]

  def create
    @vendor = Vendor.new(vendor_params)

    respond_to do |format|
      if @vendor.save
---
INSERT INTO "vendors" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "MyString"], ["created_at", 2017-03-08 14:39:46 UTC], ["updated_at", 2017-03-08 14:39:46 UTC]]

  def destroy
    @vendor.destroy
---
DELETE FROM "vendors" WHERE "vendors"."id" = ?  [["id", 980190962]]

    def set_vendor
      @vendor = Vendor.find(params[:id])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]