app/views/markets/index.html.erb

      <%= link_to market, class: "thumbnail check-market" do %>
      <% if market.market_images.all.length == 0 %>
---
SELECT "markets".* FROM "markets"