app/views/layouts/_market_cards.html.erb

SELECT  "markets".* FROM "markets" ORDER BY "markets"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
        <div class="card-block">
            <h3 class="card-title"><%=Market.first.name%></h3>